'use strict';

const testData = [{"상가업소번호":"\n\"19911397\"","상호명":"커피빈","지점명":"코리아선릉로93길점","상권업종대분류코드":"Q","상권업종대분류명":"음식","상권업종중분류코드":"Q12","상권업종중분류명":"커피점/카페","상권업종소분류코드":"Q12A01","상권업종소분류명":"커피전문점/카페/다방","표준산업분류코드":"I56220","표준산업분류명":"비알콜 음료점업","시도코드":"11","시도명":"서울특별시","시군구코드":"11680","시군구명":"강남구","행정동코드":"1168064000","행정동명":"역삼1동","법정동코드":"1168010100","법정동명":"역삼동","지번코드":"1168010100206960042","대지구분코드":"1","대지구분명":"대지","지번본번지":"696","지번부번지":"42","지번주소":"서울특별시 강남구 역삼동 696-42","도로명코드":"116804166502","도로명":"서울특별시 강남구 선릉로93길","건물본번지":"6","건물부번지":"","건물관리번호":"1168010100106960042022041","건물명":"","도로명주소":"서울특별시 강남구 선릉로93길 6","구우편번호":"135080","신우편번호":"06149","동정보":"","층정보":"","호정보":"","경도":"127.047883157395","위도":"37.505675040058"}];
const regExp = new RegExp('\n\"|\"','g');
testData.map((object)=>{
    console.log(object.상가업소번호);
    const execResult = regExp.exec(object.상가업소번호);
    console.log(execResult);
    if(execResult !== null){
        object.상가업소번호 = object.상가업소번호.replace(regExp,"");
        console.log(object.상가업소번호);
    }
});
//{"상가업소번호": "19911397"}
//